/*
? Base
Что такое React ?
Назовите основные особенности React
Какие преимущества предоставляет использование React?
Какие ограничения имеются в React?
В чем разница между обработкой событий в HTML и React?
Как работает виртуальный DOM?
В чем разница между React и ReactDOM? Почему ReactDOM отделен от React?
Что такое согласование?
Что такое JSX?
Что такое фрагмент? Почему фрагмент лучше, чем дополнительный div?
Как создаются компоненты?

? Component / Props / State
Когда лучше использовать классовый компонент, а когда функциональный?
Что такое состояние? Что такое пропы? В чем разница между состоянием и пропами?
Что такое key и в чем заключаются преимущества его использования?
Что такое управляемые/неуправляемые компоненты?
Что такое подъем состояния?
Что такое компонент высшего порядка?
Что такое контекст?
Что такое children?
Что такое примеси?

? Life Circle
Назовите стадии жизненного цикла компонента
Назовите методы жизненного цикла
Назовите методы жизненного цикла компонента, относящиеся к монтированию
Какой порядок расположения методов в классовом компоненте является рекомендуемым?
В каком порядке вызываются методы жизненного цикла при повторном рендеринге компонента?







*/
